ERM/src/Catalogs/ЗаданияPowerBI/ЗаданияPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияPowerBI</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникДанныхPowerBI</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииPowerBI</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лог</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ERM/src/InformationRegisters/ЛогВыгрузкиPowerBI/ЛогВыгрузкиPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогВыгрузкиPowerBI</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.ТипыСобытийИнтеграцииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ОперацииPowerBI</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПорядковыйНомерСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникДанныхPowerBI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/Enums/ТипыСобытийИнтеграцииPowerBI/ТипыСобытийИнтеграцииPowerBI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСобытийИнтеграцииPowerBI</name>
  <enumValues>
    <name>НачалоВыполненияЗадания</name>
  </enumValues>
  <enumValues>
    <name>ОкончаниеВыполненияЗадания</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Catalogs/ЗаданияPowerBI/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВыполнитьЗадание() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЛогирования = РегистрыСведений.ЛогВыгрузкиPowerBI.НовыеПараметрыЛогирования();
	ПараметрыЛогирования.Источник = Источник;
	ПараметрыЛогирования.Операция = Операция;
	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.НачалоВыполненияЗадания;
	ПараметрыЛогирования.Комментарий = Справочники.ЗаданияPowerBI.ОписаниеЗадания(ЭтотОбъект);
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	ПараметрыЛогирования.Комментарий = "";
	
	СтруктураРезультата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Если НЕ Родитель.Пустая() Тогда
		ТекстСообщения = СтрШаблон("Не возможно выполнить задание %1, т.к. существует родительское задание %2.", ЭтотОбъект, Родитель);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ПараметрыЛогирования.ЭтоОшибка = Истина;
		ПараметрыЛогирования.Комментарий = СтруктураРезультата.Сообщение;
		РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
		СтруктураРезультата.Результат = Ложь;
		СтруктураРезультата.Сообщение = ТекстСообщения;
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Источник));
	
	Попытка
		РезультатВыгрузки = Справочники[ОбъектМетаданных.Имя].ВыгрузитьДанныеДляPowerBI(Источник);
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, РезультатВыгрузки);
	Исключение
		СтруктураРезультата.Сообщение = ОписаниеОшибки();
		ПараметрыЛогирования.ЭтоОшибка = Истина;
		ПараметрыЛогирования.Комментарий = СтруктураРезультата.Сообщение;
	КонецПопытки;
	
	ПараметрыЛогирования.Событие = Перечисления.ТипыСобытийИнтеграцииPowerBI.ОкончаниеВыполненияЗадания;
	РегистрыСведений.ЛогВыгрузкиPowerBI.ЗалогироватьСобытие(ПараметрыЛогирования);
	
	Возврат СтруктураРезультата;
	
КонецФункции

#КонецЕсли
